.artillery/create-post.yml
config:
  target: 'http://localhost:8000'
  http:
    pool: 10
    timeout: 2
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - flow:
    - post:
        url: "/posts"
        json: 
          ID: "{{$randomString()}}"
          Title: "{{$randomString()}}"
          Body: "{{$randomString()}}"